bash/bashrc.org
#+TITLE: bash configuration
#+PROPERTY: header-args+ :results output silent :noweb tangle :comments both :mkdirp yes

* bashrc
:PROPERTIES:
:header-args+: :tangle (concat (getenv "HOME") "/.bashrc")
:END:

#+begin_src bash :export none
# This is a tangled file. Do not make any changes here. All changes should preferably be made in the original Org file.
# Use =org-babel-tangle-jump-to-org= to jump back to it from any code block.
# If any changes are made here, use =org-babel-detangle= to add it back to the original Org mode file.
#+end_src

How to check for login v/s interactive shell
#+begin_src bash :tangle no
shopt -q login_shell && echo "Login shell" || echo "Not a login shell"
[[ $- == *i* ]] && echo "This is an interactive shell" || echo "This is a script"
#+end_src

Proceed only if its an interactive shell
#+begin_src bash
[[ $- == *i* ]] || return
#+end_src

** local init
Any local settings that need to be set initially go here
#+begin_src bash
[[ -f ~/.bashrc_local_init ]] && . ~/.bashrc_local_init
#+end_src

** interactive, login shell settings
Turn off TTY "start" and "stop" commands in all interactive shells.
They default to ~C-q~ and ~C-s~. I want to use ~C-s~ to do forward history search.
#+begin_src bash
stty start ''
stty stop  ''
stty -ixon # disable XON/XOFF flow control
stty ixoff # enable sending (to app) of start/stop characters
stty ixany # let any character restart output, not only start character
#+end_src

