bash/bashrc_literate
# bashrc
# :PROPERTIES:
# :header-args+: :tangle (concat (getenv "HOME") "/.bashrc")
# :END:

# [[file:~/.config/dotfiles/bash/bashrc.org::*bashrc][bashrc:1]]
# This is a tangled file. Do not make any changes here. All changes should preferably be made in the original Org file.
# Use =org-babel-tangle-jump-to-org= to jump back to it from any code block.
# If any changes are made here, use =org-babel-detangle= to add it back to the original Org mode file.
# bashrc:1 ends here



# Proceed only if its an interactive shell

# [[file:~/.config/dotfiles/bash/bashrc.org::*bashrc][bashrc:3]]
[[ $- == *i* ]] || return
# bashrc:3 ends here

# local init
# Any local settings that need to be set initially go here

# [[file:~/.config/dotfiles/bash/bashrc.org::*local%20init][local init:1]]
[[ -f ~/.bashrc_local_init ]] && . ~/.bashrc_local_init
# local init:1 ends here

# interactive, login shell settings
# Turn off TTY "start" and "stop" commands in all interactive shells.
# They default to ~C-q~ and ~C-s~. I want to use ~C-s~ to do forward history search.

# [[file:~/.config/dotfiles/bash/bashrc.org::*interactive,%20login%20shell%20settings][interactive, login shell settings:1]]
stty start ''
stty stop  ''
stty -ixon # disable XON/XOFF flow control
stty ixoff # enable sending (to app) of start/stop characters
stty ixany # let any character restart output, not only start character
