bash/bashrc_literate
# interactive, login shell settings:1 ends here

# configuration
# default permissions

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:1]]
umask 002
# configuration:1 ends here



# [[https://unix.stackexchange.com/questions/32409/set-and-shopt-why-two][shopt v/s set]]

# Using [[https://www.gnu.org/software/bash/manual/html_node/The-Shopt-Builtin.html][shopt]]:
# ~-s~ : set
# ~-u~ : unset
# ~-q~ : query whether set/unset

# [[http://wiki.bash-hackers.org/internals/shell_options][List of shell options]]

# If set, a command name that is the name of a directory is executed as if it were the argument to the cd command.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:2]]
shopt -u autocd
# configuration:2 ends here



# If this is set, an argument to the cd builtin command that is not a directory is assumed to be the name of a variable whose value is the directory to change to.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:3]]
shopt -s cdable_vars
# configuration:3 ends here



# If set, minor errors in the spelling of a directory component in a cd command will be corrected.
# The errors checked for are transposed characters, a missing character, and a character too many.
# If a correction is found, the corrected path is printed, and the command proceeds.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:4]]
shopt -s cdspell
# configuration:4 ends here



# If this is set, Bash checks that a command found in the hash table exists before trying to execute it.
# If a hashed command no longer exists, a normal path search is performed.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:5]]
shopt -s checkhash
# configuration:5 ends here



# If set, Bash lists the status of any stopped and running jobs before exiting an interactive shell.
# If any jobs are running, this causes the exit to be deferred until a second exit is attempted without an intervening command (see Job Control).
# The shell always postpones exiting if any jobs are stopped.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:6]]
shopt -s checkjobs
# configuration:6 ends here



# If set, Bash checks the window size after each command and, if necessary, updates the values of LINES and COLUMNS.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:7]]
shopt -s checkwinsize
# configuration:7 ends here



# If set, Bash attempts to save all lines of a multiple-line command in the same history entry.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:8]]
shopt -s cmdhist
# configuration:8 ends here



# If set, Bash quotes all shell metacharacters in filenames and directory names when performing completion.
# If not set, Bash removes metacharacters such as the dollar sign from the set of characters that will be quoted in completed filenames when these metacharacters appear in shell variable references in words to be completed.
# This means that dollar signs in variable names that expand to directories will not be quoted; however, any dollar signs appearing in filenames will not be quoted, either.
# This is active only when bash is using backslashes to quote completed filenames.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:9]]
shopt -s complete_fullquote
# configuration:9 ends here



# If set, Bash replaces directory names with the results of word expansion when performing filename completion.
# This changes the contents of the readline editing buffer. If not set, Bash attempts to preserve what the user typed.
# I use it mainly to prevent bash from escaping $ in $dir_variable

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:10]]
shopt -s direxpand
# configuration:10 ends here



# If set, Bash attempts spelling correction on directory names during word completion if the directory name initially supplied does not exist.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:11]]
shopt -s dirspell
# configuration:11 ends here



# If set, Bash includes filenames beginning with a ‘.’ in the results of filename expansion.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:12]]
shopt -s dotglob
# configuration:12 ends here



# If set, aliases are expanded as described below under Aliases, Aliases.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:13]]
# shopt -s expand_aliases
# configuration:13 ends here



# If set, the extended pattern matching features (see [[https://www.gnu.org/software/bash/manual/html_node/Pattern-Matching.html#Pattern-Matching][Pattern Matching]]) are enabled.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:14]]
# shopt -s extglob
# configuration:14 ends here



# If set, patterns which fail to match filenames during filename expansion result in an expansion error.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:15]]
# shopt -s failglob
# configuration:15 ends here



# If set, the pattern ‘**’ used in a filename expansion context will match all files and zero or more directories and subdirectories.
# If the pattern is followed by a ‘/’, only directories and subdirectories match.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:16]]
# shopt -s globstar
# configuration:16 ends here


# Not using this as it's too slow! - Use [[id:2870e3ab-aa92-4006-9899-372135ae00c4][home-brewed @]] instead

# If set, shell error messages are written in the standard GNU error message format.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:17]]
# shopt -s gnu_errfmt
# configuration:17 ends here



# If set, the history list is appended to the file named by the value of the HISTFILE variable when the shell exits, rather than overwriting the file.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:18]]
shopt -s histappend
# configuration:18 ends here



# If set, and Readline is being used, a user is given the opportunity to re-edit a failed history substitution.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:19]]
shopt -s histreedit
# configuration:19 ends here



# If set, and Readline is being used, the results of history substitution are not immediately passed to the shell parser.
# Instead, the resulting line is loaded into the Readline editing buffer, allowing further modification.
# eg. commands using (!, !!, etc.) will print to shell first for confirmation and not auto-execute

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:20]]
shopt -s histverify
# configuration:20 ends here



# If set, Bash will send SIGHUP to all jobs when an interactive login shell exits (see [[https://www.gnu.org/software/bash/manual/html_node/Signals.html][Signals]]).

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:21]]
shopt -s huponexit
# configuration:21 ends here



# If set, and job control is not active, the shell runs the last command of a pipeline not executed in the background

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:22]]
shopt -s lastpipe
# configuration:22 ends here



# If enabled, and the cmdhist option is enabled, multi-line commands are saved to the history with embedded newlines rather than using semicolon separators where possible.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:23]]
shopt -s lithist
# configuration:23 ends here



# If set, and a file that Bash is checking for mail has been accessed since the last time it was checked, the message "The mail in mailfile has been read" is displayed.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:24]]
shopt -s mailwarn
# configuration:24 ends here



# If set, and Readline is being used, Bash will not attempt to search the PATH for possible completions when completion is attempted on an empty line.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:25]]
# shopt -s no_empty_cmd_completion
# configuration:25 ends here



# If set, Bash matches filenames in a case-insensitive fashion when performing filename expansion.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:26]]
# shopt -s nocaseglob
# configuration:26 ends here



# If set, Bash matches patterns in a case-insensitive fashion when performing matching while executing case or =[[= conditional commands,
# when performing pattern substitution word expansions, or when filtering possible completions as part of programmable completion.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:27]]
# shopt -s nocasematch
# configuration:27 ends here



# If set, Bash allows filename patterns which match no files to expand to a null string, rather than themselves.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:28]]
# shopt -s nullglob
# configuration:28 ends here



# If this is set, the shift builtin prints an error message when the shift count exceeds the number of parameters.

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:29]]
shopt -s shift_verbose
# configuration:29 ends here

# [[file:~/.config/dotfiles/bash/bashrc.org::*configuration][configuration:30]]
set -o noclobber
#set -o vi
set bell-style none
# Otherwise some completions will fail
set +o nounset
