bash/bashrc.org
** ENVIRONMENT variables
*** history
NOTE: exporting a variable makes it available for child processes via the environment

Increase size of history in the terminal. Default is a measly 512 lines
#+begin_src bash
export HISTSIZE=65535
export HISTFILESIZE=65535
#+end_src

Add timestamps to history
#+begin_src bash
export HISTTIMEFORMAT="%F %T  "
#+end_src

Ignore duplicates and trivial one/two char commands as I've a bad habit of doing =cl= all the time.
Furthermore, I can add all the commands I want to ignore to it as well.
#+begin_src bash
export HISTIGNORE='?:??:history*:sosc:que*:ll*'
#+end_src

=ignoredups= allows me to ignore the same command type multiple times consecutively
=ignorespace= does not add commands that start with a space to the history just in case I don't want to log something
=ignoreboth= does both
#+begin_src bash
export HISTCONTROL=ignoreboth
#+end_src

Keeps history forever. Requires ~PROMPT_COMMAND='history -a; history -r'~
#+begin_src bash :tangle no
HISTFILE="${XDG_DATA_HOME:-$HOME/.local/share}/bash_history/$(date +%Y/%m/%d)_${HOSTNAME%%.*}_${USER}_$$"
[[ -d $(dirname ${HISTFILE}) ]] || mkdir -p $(dirname ${HISTFILE})
#+end_src
However, a downside of this is that when sessions span multiple days, commands end up getting logged in the wrong files
Thus, I've moved this to =PROMPT_COMMAND= instead to keep the HISTFILE current.

*** misc

#+begin_src bash
export EDITOR=vim
export VISUAL=gvim
#+end_src

Make less more friendly for non-text input files, see lesspipe(1)
#+begin_src bash
export MANPAGER=less
export PAGER=less
[[ -x /usr/bin/lesspipe ]] && eval "$(SHELL=/bin/sh lesspipe)"
#+end_src

#+begin_src bash
export HOSTNAME="$(hostname)"
export LANG=en_US.UTF-8
#+end_src

** colors
*** ls colors
See [[id:2823d31a-572c-44ec-80e1-84acbbb6412e][dircolors]]
#+begin_src bash
if [[ -x /usr/bin/dircolors ]]; then
    _dircolors=${XDG_CONFIG_HOME:-$HOME/.config}/dotfiles/bash/dircolors
    [[ -r $_dircolors ]] && eval "$(/usr/bin/dircolors -b $_dircolors)" || eval "$(/usr/bin/dircolors -b)"
fi
#+end_src

*** base16 themes
#+begin_src bash
export BASE16_SHELL=${XDG_CONFIG_HOME:-$HOME/.config}/base16-shell
[[ -n "$PS1" ]] && [[ -s $BASE16_SHELL/profile_helper.sh ]] && eval "$($BASE16_SHELL/profile_helper.sh)"
if [[ -f ~/.base16_theme ]]; then
  . ~/.base16_theme
else
  base16_solarized-light &> /dev/null
fi
#+end_src

*** colored man pages with less
#+begin_src bash
man() {
    env \
        LESS_TERMCAP_mb=$(printf "\e[1;31m") \
        LESS_TERMCAP_md=$(printf "\e[1;31m") \
        LESS_TERMCAP_me=$(printf "\e[0m") \
        LESS_TERMCAP_se=$(printf "\e[0m") \
        LESS_TERMCAP_so=$(printf "\e[0;43;30m") \
        LESS_TERMCAP_ue=$(printf "\e[0m") \
        LESS_TERMCAP_us=$(printf "\e[1;32m") \
        man "$@"
}
#+end_src

** utilities
*** @: a simpler and faster alternative to globstar
:LOGBOOK:
- Refiled on [2021-03-08 Mon 06:33]
:END:
=@ ls /some/long/path/**/that/I/dont/want/to/type= is converted to =ls $(find /some/long/path/ -path '*/that/I/dont/want/to/type')=

#+begin_src bash
unset -f @
function @ {
    # Description:
    # @ ls /some/long/path/**/that/I/dont/want/to/type is converted to
    #   ls $(find /some/long/path/ -path '*/that/I/dont/want/to/type')

    local _cmd=()
    for i in "$@"; do
        if [[ $i =~ '**' ]]; then
            _cmd+=('$(find'    $(command awk 'BEGIN {FS="**"} {print $1}' <<< "$i"))
            _cmd+=('-path' "'*"$(command awk 'BEGIN {FS="**"} {print $2}' <<< "$i")"')")
        else
            _cmd+=("$i")
        fi
    done
    # echo "${_cmd[@]}"
    # echo
    eval "${_cmd[@]}"
}
#+end_src

*** alert
:LOGBOOK:
- Refiled on [2021-03-08 Mon 06:33]
:END:
Simply function to "alert" when a command completes.
NOTE: This must be used as a function to have access to the history via the fc command

Use like this: =sleep 10 && alert=
#+begin_src bash
unset -f alert
alert() {
    # Pick up display message if provided as argument. If not show the last command that was run
    local _msg=${1:-"'$(fc -nl -1 | sed -e 's/^\s*//' -e 's/\s*[;&|]\+\s*alert$//')' has completed"}

    # Add TMUX information if available
    if [[ -n $TMUX ]]; then
        _msg="$(tmux display-message -p "[#S:#I.#P]") $_msg"
    else
        _msg="[$$] $_msg"
    fi

    # Indicate normal completion or error
    local _icon=$( (($? == 0)) && echo terminal || echo error)

    notify-send --urgency=low -i $_icon "$_msg"
}
#+end_src

*** calc
:LOGBOOK:
- Refiled on [2021-03-08 Mon 06:33]
:END:
Simple wrapper around =irb= to make it more natural to use. eg. ~= 4 + 5~
#+begin_src bash
unset -f =
=() {                                                                                                             # {{{1
    local _input="${@:-$(</dev/stdin)}"
    # echo $_input

    # if [[ $_input =~ [:xdigit:]+\[[:digit:]+:[:digit:]+\] ]]; then
    #   _input=${_input#.*[}
    #   echo $_input
    #   return
    # fi
    # = "($_input >> $_lsb) & ($_msb - $_lsb)"

    # If there's no explicit output formatting, try to infer from the input
    if [[ ! $_input =~ to_s ]]; then
        if [[ $_input =~ 0x ]] || [[ $_input =~ [a-fA-F] ]]; then
            local _base=16
        elif [[ $_input =~ 0b ]]; then
            local _base=2
        fi
        _input="($_input).to_s($_base)"
    fi

    local _result=$(echo "$_input" | irb -m --noverbose | command sed 's/"//g')

    # Pretty-print formatted output
    if [[ $_input =~ 'to_s(16)' ]]; then
        _result="0x${_result}"
    elif [[ $_input =~ 'to_s(2)' ]]; then
        _result="0b${_result}"
    fi

    echo $_result
}
#+end_src

Simple base-converter
#+begin_src bash
unset -f =base
=base() (                                                                                                         # {{{1
    _help () { #{{{
        echo 'SYNTAX:'
        echo '  =base NUM TO [FROM=10]'
        echo '  echo NUM | =base TO [FROM=10]'
        echo '  =base TO [FROM=10] <<< "NUM"'
    } # }}}

    if (( $# <= 1 )); then
        echo -e "ERROR: Insufficient arguments. At least two required\n"; _help
        return 1
    fi

    if [[ -p /dev/stdin ]] || [[ -s /dev/stdin ]]; then
        # From pipe or from redirection respectively
        local _num=$(</dev/stdin)
    else
        local _num=$1
        shift
    fi

    local _obase=$1
    local _ibase=${2:-10}

    case $_ibase in
        2)  _num=${_num#0[bB]} ;;
        16) _num=$(tr '[a-f]' '[A-F]' <<< "${_num#0[xX]}") ;;
    esac

    local _result=$(echo "obase=$_obase; ibase=$_ibase; $_num" | bc)
    case $_obase in
        2)  _result="0b${_result}" ;;
        16) _result="0x${_result}" ;;
    esac

    echo $_result
)

=bin() { =base $1  2 ${2:-10}; }  # Convert to binary, by default from decimal
=dec() { =base $1 10 ${2:-16}; }  # Convert to decimal, by default from hexadecimal
=hex() { =base $1 16 ${2:-10}; }  # Convert to hexadecimal, by default from decimal
#+end_src

#+begin_src bash
unset -f =slice
=slice() (
    _help() {
        echo 'SYNTAX:'
        echo '  =slice NUM MSB LSB'
        echo '  =slice NUM BIT'
        echo '  echo NUM | =slice MSB LSB'
        echo '  =slice MSB LSB <<< "NUM"'
        echo
        echo "NOTE: MSB >= LSB"
    }

    if (( $# >= 3 )); then
        local _num=$1
        shift
    elif [[ -p /dev/stdin ]] || [[ -s /dev/stdin ]]; then
        # From pipe or from redirection respectively
        local _num=$(</dev/stdin)
    elif (( $# < 1 )); then
        echo -e "ERROR: Insufficient arguments. At least one more required\n"; _help
        return 1
    else
        local _num=$1
        shift
    fi

    local _msb=$1
    local _lsb=${2:-$_msb}

    if (( $_lsb > $_msb )); then
        echo -e "ERROR: MSB must be greater than or equal to LSB when slicing\n"; _help
        return 1
    fi

    # echo "in=$_num, msb=$_msb, lsb=$_lsb"
    = "($_num >> $_lsb) & ((1 << ($_msb - $_lsb + 1)) - 1)"
)
#+end_src

*** dir related
:LOGBOOK:
- Refiled on [2021-03-08 Mon 06:33]
:END:
#+begin_src bash
alias md='mkdir -p'

# Create new dir(s) and enter it (last directory if multiple arguments are given)
unset -f mcd
mcd() {
    command mkdir -p "$@" || return
    cd -- "${@: -1}"
}
#+end_src

NOTE: The use of $* is deliberate here as it produces all the scripts arguments separated by the first character of $IFS which, by default, is a space. This allows me to match all arguments against a regex in one go instead of looping over them
#+begin_src bash
dirs() {
    if (( $# == 0 )); then
        builtin dirs -v
    elif [[ "$*" =~ [-+][0-9]+ ]]; then
        # Use long-listing format. Without this, the home directory is display as '~' preventing me from doing something
        # like `cp $(dirs +1)` as it results in an error: pushd: ~/.vim: No such file or directory
        builtin dirs "$@" -l
    else
        builtin dirs "$@"
    fi
}
#+end_src

Silent pushd and uniquifies while pushing
#+begin_src bash
pushd() {
    builtin pushd "$@" > /dev/null;

    # Remove any duplicate entries. The 1st entry will be the PWD so skip it
    local _dir_pos=$(dirs -l -v | tail -n+2 | grep "$PWD$" | sed 's/^\s*//' | cut -d ' ' -f1 | paste -s)
    command popd -n +$_dir_pos &> /dev/null
}
#+end_src

Better dirstack. Adds the following to the usual =cd= behavior:
- =cd ==           Lists the contents of the stack and use fzf to select from it
- =cd=             (with no args) Goes to $REPO_PATH if it's set. If not, or if already on $REPO_PATH, goes to $HOME
- =cd ... [TARG]=  Jump to a directory in the path that starts with TARG.
                 If TARG is not given, show all directories in the filepath and use fzf to select

Note that =pushd= calls =cd= under the hood. So =cdable_vars= and =cdspell= apply to =pushd= as well
#+begin_src bash
cd() {
    if (( "$#" == 0 )); then
        if vcs::is_in_repo > /dev/null; then
            local _dir="$(vcs::get_root)"
            if [[ "$PWD" != "$_dir" ]]; then
                cd "$_dir"
                return
            fi
        fi
        cd "$HOME"
        return
    fi

    case "$1" in
        -)
            pushd
            return
            ;;

        =)
            if hash fzf 2> /dev/null; then
                $(FZF_ALT_C_COMMAND='command dirs -l -p' __fzf_cd__)
            else
                dirs
            fi
            return
            ;;

        ...)
            if hash fzf 2> /dev/null; then
                $(FZF_ALT_C_COMMAND='_dir=$PWD; while [[ -n "$_dir" ]]; do _dir="${_dir%/[^/]*}"; echo ${_dir:-/}; done' \
                    FZF_ALT_C_OPTS="${FZF_ALT_C_OPTS} --select-1 ${2+ --query=$2}" __fzf_cd__)
            fi
            return
            ;;

        ,*\*\**)
            # Split $1 about the first ** into '_path' and '_pattern'.
            local _path=${1%%\*\**}; _path=${_path:-.}
            local _pattern="*$(tr -s '*' <<< ${1#*\*\*})*"

            if hash fzf 2> /dev/null; then
                # Find '_path' for all dirs that match the glob expr '_pattern' and select with FZF from the results
                $(FZF_ALT_C_COMMAND="find ${_path} -type d -path '*${_pattern}*'" __fzf_cd__)
                return
            else
                _dir=$(find $_path -type d -path "*${_pattern}*" -print -quit)
                if [[ -n $_dir ]]; then
                    pushd "$_dir"
                fi
            fi
            ;;
    esac

    pushd "$@"
}

alias ..='cd ..'
#+end_src

