bash/bashrc_literate
# configuration:30 ends here

# history
# NOTE: exporting a variable makes it available for child processes via the environment

# Increase size of history in the terminal. Default is a measly 512 lines

# [[file:~/.config/dotfiles/bash/bashrc.org::*history][history:1]]
export HISTSIZE=65535
export HISTFILESIZE=65535
# history:1 ends here



# Add timestamps to history

# [[file:~/.config/dotfiles/bash/bashrc.org::*history][history:2]]
export HISTTIMEFORMAT="%F %T  "
# history:2 ends here



# Ignore duplicates and trivial one/two char commands as I've a bad habit of doing =cl= all the time.
# Furthermore, I can add all the commands I want to ignore to it as well.

# [[file:~/.config/dotfiles/bash/bashrc.org::*history][history:3]]
export HISTIGNORE='?:??:history*:sosc:que*:ll*'
# history:3 ends here



# =ignoredups= allows me to ignore the same command type multiple times consecutively
# =ignorespace= does not add commands that start with a space to the history just in case I don't want to log something
# =ignoreboth= does both

# [[file:~/.config/dotfiles/bash/bashrc.org::*history][history:4]]
export HISTCONTROL=ignoreboth
# history:4 ends here

# misc


# [[file:~/.config/dotfiles/bash/bashrc.org::*misc][misc:1]]
export EDITOR=vim
export VISUAL=gvim
# misc:1 ends here



# Make less more friendly for non-text input files, see lesspipe(1)

# [[file:~/.config/dotfiles/bash/bashrc.org::*misc][misc:2]]
export MANPAGER=less
export PAGER=less
[[ -x /usr/bin/lesspipe ]] && eval "$(SHELL=/bin/sh lesspipe)"
# misc:2 ends here

# [[file:~/.config/dotfiles/bash/bashrc.org::*misc][misc:3]]
export HOSTNAME="$(hostname)"
export LANG=en_US.UTF-8
# misc:3 ends here

# ls colors
# See [[id:2823d31a-572c-44ec-80e1-84acbbb6412e][dircolors]]

# [[file:~/.config/dotfiles/bash/bashrc.org::*ls%20colors][ls colors:1]]
if [[ -x /usr/bin/dircolors ]]; then
    _dircolors=${XDG_CONFIG_HOME:-$HOME/.config}/dotfiles/bash/dircolors
    [[ -r $_dircolors ]] && eval "$(/usr/bin/dircolors -b $_dircolors)" || eval "$(/usr/bin/dircolors -b)"
fi
# ls colors:1 ends here

# base16 themes

# [[file:~/.config/dotfiles/bash/bashrc.org::*base16%20themes][base16 themes:1]]
export BASE16_SHELL=${XDG_CONFIG_HOME:-$HOME/.config}/base16-shell
[[ -n "$PS1" ]] && [[ -s $BASE16_SHELL/profile_helper.sh ]] && eval "$($BASE16_SHELL/profile_helper.sh)"
base16_solarized-light &> /dev/null
# base16 themes:1 ends here

# colored man pages with less

# [[file:~/.config/dotfiles/bash/bashrc.org::*colored%20man%20pages%20with%20less][colored man pages with less:1]]
man() {
    env \
        LESS_TERMCAP_mb=$(printf "\e[1;31m") \
        LESS_TERMCAP_md=$(printf "\e[1;31m") \
        LESS_TERMCAP_me=$(printf "\e[0m") \
        LESS_TERMCAP_se=$(printf "\e[0m") \
        LESS_TERMCAP_so=$(printf "\e[0;43;30m") \
        LESS_TERMCAP_ue=$(printf "\e[0m") \
        LESS_TERMCAP_us=$(printf "\e[1;32m") \
        man "$@"
}
# colored man pages with less:1 ends here
