bash/bashrc.org
*** vcs
Collection of utilities to deal with all VCS related stuff

#+begin_src bash
vcs::is_in_git_repo() {
    local _cwd=$PWD
    if (( $# > 0 )); then
        command cd $1
    fi

    git rev-parse HEAD &> /dev/null
    local _ret=$?

    if (( $# > 0 )); then
        command cd $_cwd
    fi

    return $_ret
}

vcs::is_in_perforce_repo() {
    local _cwd=$PWD
    if (( $# > 0 )); then
        command cd $1
    fi

    p4 info &> /dev/null
    local _ret=$?

    if (( $# > 0 )); then
        command cd $_cwd
    fi

    return $_ret
}

vcs::is_in_repo() {
    vcs::is_in_git_repo "$@" || vcs::is_in_perforce_repo "$@"
}

vcs::get_type() {
    # Description: Check if specified directory is under a Version-controlled system
    # Arguments: 1 - Variable to return VCS type
    #            2 - Directory to check. If skipped, defaults to PWD

    if vcs::is_in_git_repo "$@"; then
        echo "git"
    elif vcs::is_in_perforce_repo "$@"; then
        echo "p4"
    else
        # No VCS. Return empty string
        echo ""
    fi
}

vcs::get_branch() {
    # Description: If PWD is under a VCS, return the branch. If not, return an empty string
    # Arguments:
    # - $1 (optional): Use that as the VCS type instead of calculating it

    local _vcs_type=${1-$(vcs::get_type)}
    #echo "DEBUG: VCS Type=$_vcs_type (vcs::get_branch)"

    if [[ $_vcs_type == "git" ]]; then
        git symbolic-ref --short HEAD 2> /dev/null
    elif [[ $_vcs_type == "p4" ]] && [[ -n "$REPO_PATH" ]] && [[ -f "$REPO_PATH/configuration_id" ]]; then
        echo "$(sed 's/@.*//' "$REPO_PATH/configuration_id" 2> /dev/null)"
    else
        echo ""
    fi
}

vcs::get_status() {
    # Description: Get the status of the VCS - works only for git at the moment
    # Arguments:
    # - $1 (optional): Use as the VCS type instead of calculating it
    # - $2 (optional): Use as the VCS branch instead of calculating it

    local _vcs_type=${1-$(vcs::get_type)}
    local _vcs_branch=${2-$(vcs::get_branch $_vcs_type)}

    if [[ "$_vcs_type" == "git" ]]; then
        if $(echo "$(git log origin/$_vcs_branch..HEAD 2> /dev/null)" | grep '^commit' &> /dev/null); then
            echo "staged"
        elif [[ -n $(git status -s --ignore-submodules=dirty  2> /dev/null) ]]; then
            echo "modified"
        else
            echo "committed"
        fi
    fi
}

vcs::get_root() {
    if vcs::is_in_git_repo "$@"; then
        echo "$(git rev-parse --show-toplevel)"
    elif vcs::is_in_perforce_repo "$@"; then
        echo "$REPO_PATH"
    else
        echo ""
    fi
}
#+end_src

** aliases
Provide a default alias here for the most commonly found tools eg. =grep=, =find= etc.
They might be overridden later by other similar tools if available eg. =ag=, =rg=, =fd= etc.

*Aliases v/s Functions*
A big limitation of aliases is that they are only expanded as the first argument, or after another alias with a trailing space on the end of the command.

eg. let's say I have the following aliases set up
#+begin_src bash :tangle no
alias g=grep
alias vq='v -q <(!!)'
#+end_src
Now, if I run =g SOMETHING= followed by =vq= then =vq= doesn't run as expected because ~!!~ expands to 'g SOMETHING'.
However, in the expanded form, 'g' doesn't get replaced with grep because of the afore-mentioned limitation.

To avoid this, I use functions for my most commonly used aliases so that they work everywhere and, aliases only if I'm sure that they won't be used in the middle of a command.

#+begin_src bash
alias ls='ls -FLH --color=always'
alias l=ls
alias la='ls -A'
alias ll='ls -lh'
alias lla='ll -A'
#+end_src

#+begin_src bash
alias c=clear
alias cl="c;l"

#alias echo '\echo -e'
#alias lock='/usr/local/bin/xlock'
alias mv='mv -vi'
alias cp='cp -vi'
alias rm='rm -vi'
alias rd='rm -rvf'
alias ln='ln -svi'
alias df='df -h'
alias pppath='tr ":" "\n" <<< $PATH'
alias clnpath='export PATH=$(tr ":" "\n" <<< $PATH | perl -ne "print unless \$seen{\$_}++" | paste -s -d":")'

alias C=cat
alias P=$PAGER
alias hh='history | tail'
alias x=exit
alias k9='kill -9'
alias j='jobs -l'
alias pls='sudo $(history -p !!)'
duh() { du -h "$@" | sort -rh; }

ec() { emacsclient --alternate-editor="" --no-wait --create-frame --quiet "$@" & }
alias e=ec
alias evan='emacs --with-profile vanilla'
#+end_src

From https://askubuntu.com/a/185746/38952
Using ww twice ensures that the output is not truncated to the width of the terminal
#+begin_src bash
psgrep() { ps wwup $(command pgrep -f "$@"); }
#+end_src

bookmarks for commonly used config files
#+begin_src bash
alias gosc='$VISUAL ~/.bashrc'
alias gost='$VISUAL ~/.dotfiles/tmux/tmux.conf'
alias gosx='$VISUAL ~/.Xresources'
alias sosc='. ~/.bashrc && clnpath'
#+end_src

*** grep
#+begin_src bash
export GREP_COLORS='1;32'
alias grep='grep -sP --color=always'
#+end_src

I use ~g~ as a generic alias for grep and all its replacements. Hence create a generic alias
#+begin_src bash
alias g=grep
alias gi='g -i'
alias gv='g -v'
#+end_src

*** git
#+begin_src bash
  alias ga='git add'
  alias gA='git add -A .'
  alias gh='git help'
  alias gs='git status'
#+end_src

*** perforce
#+begin_src bash
alias pf='p4'
alias pfd='pf diff'
alias pfdg='P4DIFF= pf diff -du | grepdiff --output-matching=hunk'
alias pfe='pf edit'
alias pflog='pf filelog -stl -m 5'
#+end_src

Make opened files prettier by aligning the columns
#+begin_src bash
pfo() {
    pf opened "$@" | command column -s# -o ' #' -t | command column -o ' ' -t | command sed 's/#/   #/'
}

pfrel() {
    if [[ ! -t 0 ]]; then
        pf where $(command sed -e 's/#.*//' < /dev/stdin)
    elif [[ -n "$1" ]]; then
        pf where $(command sed -e 's/#.*//' "$@")
    else
        return
    fi |  awk "{ if (\$3 != \"$REPO_PATH/...\") { print \$3; } }" | sed -e "s:$REPO_PATH/::"
}

pfor() {
    pfo | pfrel
}
#+end_src

Show top N (default=10) changes
#+begin_src bash
pftop() {
    local num=10
    if (( $# > 0 )) && [[ "$1" =~ ^[0-9]+$ ]]; then
        num=$1
        shift
    fi
    pf changes -m $num "$@" $STEM/...
}
#+end_src

*** rm
Delete in background
#+begin_src bash
unset -f rm_rf
rm_rf_silent() {
    # FIXME: Doesn't work if there are spaces in the filename
    for i in "$@"; do
        # Remove trailing slash and move to hidden
        ni=${i/%\//}
        bi=$(basename $ni)
        ni=${ni/%$bi/.$bi}

        #echo $ni.$$
        command mv $i $ni.$$
        command rm -rf $ni.$$ &
    done
}
alias rdj='rm_rf_silent'
#+end_src

