bash/bashrc_literate
# query:1 ends here

# [[file:~/.config/dotfiles/bash/bashrc.org::*query][query:2]]
alias que=query
# query:2 ends here


# Now, if I run =g SOMETHING= followed by =vq= then =vq= doesn't run as expected because ~!!~ expands to 'g SOMETHING'.
# However, in the expanded form, 'g' doesn't get replaced with grep because of the afore-mentioned limitation.

# To avoid this, I use functions for my most commonly used aliases so that they work everywhere and, aliases only if I'm sure that they won't be used in the middle of a command.


# [[file:~/.config/dotfiles/bash/bashrc.org::*aliases][aliases:2]]
alias ls='ls -FLH --color=always'
alias l=ls
alias la='ls -A'
alias ll='ls -lh'
alias lla='ll -A'
# aliases:2 ends here

# [[file:~/.config/dotfiles/bash/bashrc.org::*aliases][aliases:3]]
alias c=clear
alias cl="c;l"

#alias echo '\echo -e'
#alias lock='/usr/local/bin/xlock'
alias mv='mv -vi'
alias cp='cp -vi'
alias rm='rm -vi'
alias rd='rm -rvf'
alias ln='ln -svi'
alias df='df -h'
alias pppath='tr ":" "\n" <<< $PATH'
alias clnpath='export PATH=$(tr ":" "\n" <<< $PATH | perl -ne "print unless \$seen{\$_}++" | paste -s -d":")'

alias C=cat
alias P=$PAGER
alias hh='history | tail'
alias x=exit
alias k9='kill -9'
alias j='jobs -l'
alias pls='sudo $(history -p !!)'
duh() { du -h "$@" | sort -rh; }

ec() { emacsclient --alternate-editor="" --no-wait --create-frame --quiet "$@" & }
alias e=ec
alias evan='emacs --with-profile vanilla'
# aliases:3 ends here



# From https://askubuntu.com/a/185746/38952
# Using ww twice ensures that the output is not truncated to the width of the terminal

# [[file:~/.config/dotfiles/bash/bashrc.org::*aliases][aliases:4]]
psgrep() { ps wwup $(command pgrep -f "$@"); }
# aliases:4 ends here



# bookmarks for commonly used config files

# [[file:~/.config/dotfiles/bash/bashrc.org::*aliases][aliases:5]]
alias gosc='$VISUAL ~/.bashrc'
alias gost='$VISUAL ~/.dotfiles/tmux/tmux.conf'
alias gosx='$VISUAL ~/.Xresources'
alias sosc='. ~/.bashrc && clnpath'
# aliases:5 ends here

# grep

# [[file:~/.config/dotfiles/bash/bashrc.org::*grep][grep:1]]
export GREP_COLORS='1;32'

alias grep='grep -sP --color=always'
alias gi='grep -i'
alias gv='grep -v'
# grep:1 ends here

# git

# [[file:~/.config/dotfiles/bash/bashrc.org::*git][git:1]]
alias ga='git add'
alias gA='git add -A .'
alias gh='git help'
alias gs='git status'
# git:1 ends here

# perforce

# [[file:~/.config/dotfiles/bash/bashrc.org::*perforce][perforce:1]]
alias pf='p4'
alias pfd='pf diff'
alias pfdg='P4DIFF= pf diff -du | grepdiff --output-matching=hunk'
alias pfe='pf edit'
alias pflog='pf filelog -stl -m 5'
# perforce:1 ends here



# Make opened files prettier by aligning the columns

# [[file:~/.config/dotfiles/bash/bashrc.org::*perforce][perforce:2]]
pfo() {
    pf opened "$@" | command column -s# -o ' #' -t | command column -o ' ' -t | command sed 's/#/   #/'
}

pfor() {
    pf where $(pf opened "$@" | command sed -e 's/#.*//') |
        awk "{ if (\$3 != \"$REPO_PATH/...\") { print \$3; } }" | sed -e "s:$REPO_PATH/::"
}
# perforce:2 ends here



# Show top N (default=10) changes

# [[file:~/.config/dotfiles/bash/bashrc.org::*perforce][perforce:3]]
pftop() {
    local num=10
    if (( $# > 0 )) && [[ "$1" =~ ^[0-9]+$ ]]; then
        num=$1
        shift
    fi
    pf changes -m $num "$@" $STEM/...
}
# perforce:3 ends here

# rm
# Delete in background

# [[file:~/.config/dotfiles/bash/bashrc.org::*rm][rm:1]]
unset -f rm_rf
rm_rf_silent() {
    # FIXME: Doesn't work if there are spaces in the filename
    for i in "$@"; do
        # Remove trailing slash and move to hidden
        ni=${i/%\//}
        bi=$(basename $ni)
        ni=${ni/%$bi/.$bi}

        #echo $ni.$$
        command mv $i $ni.$$
        command rm -rf $ni.$$ &
    done
}
alias rdj='rm_rf_silent'
