bash/bashrc.org
*** prompt
This is based on [[http://stevelosh.com/blog/2010/02/my-extravagant-zsh-prompt/][SJL's prompt]] and [[http://aperiodic.net/phil/prompt/][Phil's Zsh prmpt]]. This is what it looks like:
#+begin_example
  ┌ kshenoy @ svvgar-nx16 in ~/.vim ───────────────────── 03:57pm Aug 02, Fri
  └ (^_^) ➤
#+end_example

The function has to be called '__setprompt' as that's what =PROMPT_COMMAND= is set to
#+begin_src bash
__setprompt() {
    # Colors and line-graphics that I use commonly
    <<prompt-common>>
#+end_src

This is all the information I need to set my prompt!
#+begin_src bash
# This has to be placed first
local _exit_status="$?"

# We use this instead of $COLUMNS as when a shell is starting, the $COLUMNS variable is not set
local _columns=$(tput cols)

# The info variables
local _pwd=$(prompt::get_compact_pwd)

# Force time to US Mountain Time. I don't want to export TZ as it messes up some other scripts
local _time="$(TZ=US/Mountain date +%I:%M%P) "
local _user="$(whoami) "
local _user_host_sep="@ "
local _pwd_sep="in "
local _host="$(hostname) "
#+end_src

If root user then colour the arrow red.
#+begin_src bash
if (( "$UID" == 0 )); then
    local _fg_user_symbol=$_fg_red
else
    local _fg_user_symbol=${_bold}${_fg_light_black}
fi
#+end_src

VCS specific
#+begin_src bash
local _vcs_type=$(vcs::get_type)
local _vcs_branch=$(vcs::get_branch $_vcs_type)
local _vcs_sep=" on "

if [[ $_vcs_type == "git" ]]; then
    local _user_symbol=" ±"
elif [[ $_vcs_type == "hg" ]]; then
    local _user_symbol=" ☿"
elif [[ $_vcs_type == "p4" ]]; then
    local _vcs_sep=" on "
else
    #local _user_symbol=" ○"
    #local _user_symbol=" ➤"
    local _user_symbol=" $"
    local _vcs_sep=""
fi
#+end_src

Here, I try to decide what all to put on the prompt depending on the width of the screen.
I work backwards by constructing the full prompt and remove stuff if it's longer than the screen width as most of the it won't be.

Start with everything of interest
#+begin_src bash
_info="${_ulcorner} ${_user}${_user_host_sep}${_host}${_pwd_sep}${_pwd}${_vcs_sep}${_vcs_branch} ${_time}"
#+end_src

If info is wider than the screen, drop the time
#+begin_src bash
if (( $_columns < ${#_info} )); then
    _time=""
    _info="${_ulcorner} ${_user}${_user_host_sep}${_host}${_pwd_sep}${_pwd}${_vcs_sep}${_vcs_branch} "
fi
_pwd_sep="${_fg_light_black}${_pwd_sep}${_reset}"
#+end_src

If the info still can't fit, drop user and domain info
#+begin_src bash
if (( $_columns < ${#_info} )); then
    _user=""
    _user_host_sep=""
    _host=""
    _pwd_sep=""
    _info="${_ulcorner} ${_pwd}${_vcs_sep}${_vcs_branch} "
fi
#+end_src

If the info still can't fit, drop vcs branch
#+begin_src bash
if (( $_columns < ${#_info} )); then
    _vcs_sep=""
    _vcs_branch=""
    _info="${_ulcorner} ${_pwd} "
fi
#+end_src

If the info still can't fit, truncate PWD
#+begin_src bash
if (( $_columns < ${#_info} )); then
    _pwd_sep="..."
    while (( $_columns < ${#_info} )); do
        _pwd=`echo $_pwd | sed 's|^/\?[^/]*/||'`
        _info="${_ulcorner} ${_pwd_sep}${_pwd} "
    done
    _pwd_sep="${_bold}${_fg_green}${_pwd_sep}${_reset}"
fi

local _fillsize=$(( $_columns - ${#_info} - 1 ))
local _fill=$(printf "${_dash}%.0s" $(seq 1 $_fillsize))" "
#+end_src

Colorize vcs:
#+begin_src bash
if [[ $_vcs_type == "git" ]]; then
    local _vcs_status=$(vcs::get_status ${_vcs_type} ${_vcs_branch})
    if [[ "${_vcs_status}" == "staged" ]]; then
        _vcs_branch="${_fg_yellow}${_vcs_branch}${_reset}"
    elif [[ "${_vcs_status}" == "modified" ]]; then
        _vcs_branch="${_fg_red}${_vcs_branch}${_reset}"
    elif [[ "${_vcs_status}" == "committed" ]]; then
        _vcs_branch="${_fg_green}${_vcs_branch}${_reset}"
    fi
elif [[ $_vcs_type == "p4" ]]; then
    if (( $(p4 opened 2> /dev/null | wc -l) > 0 )); then
        _vcs_branch="${_fg_red}${_vcs_branch}${_reset}"
    else
        _vcs_branch="${_fg_green}${_vcs_branch}${_reset}"
    fi
fi
#+end_src

Create exit status indicator based on exit status of last command
#+begin_src bash
if (( "$_exit_status" == 0 )); then
    _exit_status="${_bold}${_fg_green} (^_^)"
else
    _exit_status="${_fg_red} (@_@)"
fi
#+end_src

Now that I've decided what all I want to put on the prompt and how, it's time to set the prompt variables
#+begin_src bash
PS1="\n${_reset}"
PS1+="${_fg_light_black}${_ulcorner}${_reset} "
PS1+="${_fg_red}${_user}${_reset}"
PS1+="${_fg_light_black}${_user_host_sep}${_reset}"
PS1+="${_fg_yellow}${_host}${_reset}"
PS1+="${_pwd_sep}"
PS1+="${_fg_blue}${_pwd}${_reset}"
PS1+="${_fg_light_black}${_vcs_sep}${_reset}"
PS1+="${_vcs_branch} "
PS1+="${_fg_light_black}${_fill}${_reset}"
PS1+="${_fg_yellow}${_time}${_reset}"
PS1+="\n"
PS1+="${_fg_light_black}${_llcorner}${_reset}"
PS1+="${_exit_status}${_reset}"
PS1+="${_fg_user_symbol}${_user_symbol}${_reset} "

PS2="      ${_fg_user_symbol}...${_reset}   "
#+end_src

Evaluate dynamic variables only if dyn_vars is defined (Not required for prompt)
#+begin_src bash
declare -F dyn_vars &> /dev/null && dyn_vars
#+end_src

Set HISTFILE here to keep it current when sessions span multiple days
FIXME: Find a better way to do this i.e. do it once a day instead of everytime the prompt is refreshed
#+begin_src bash
HISTFILE="${XDG_DATA_HOME:-$HOME/.local/share}/bash_history/$(date +%Y/%m/%d)_${HOSTNAME%%.*}_${USER}_$$"
[[ -d $(dirname ${HISTFILE}) ]] || mkdir -p $(dirname ${HISTFILE})
#+end_src

Write to the history file immediately instead of waiting till the end of the session
#+begin_src bash
history -a
}
#+end_src

** PATH
#+begin_src bash
if ((which ruby &> /dev/null) && (which gem &> /dev/null)); then
  export PATH="$(ruby -rubygems -e 'puts Gem.user_dir')/bin:$PATH"
fi
export PATH="$HOME/bin:$HOME/.local/bin:$PATH"
clnpath
#+end_src

** local override
Update permissions of the history when exiting as root
#+begin_src bash
__histfile_perm_update__() {
    if [[ -f $HISTFILE ]]; then
        echo "Changing permissions of HISTFILE..."
        chown kshenoy $HISTFILE
        chgrp kshenoy $HISTFILE
        chmod 640 $HISTFILE
    fi
}
trap __histfile_perm_update__ EXIT

## When leaving the console, clear the screen to increase privacy
if [[ "$SHLVL" = 1 ]]; then
    [[ -x /usr/bin/clear_console ]] && /usr/bin/clear_console -q
fi
#+end_src

*** home
To connect to work-vpn
#+begin_src bash :tangle (if (string-match "buntu" (system-name)) (concat (getenv "HOME") "/.bashrc") "no")
alias gp=globalprotect

work_vpn() {
    # if command grep Connected <<< $(globalprotect show --status); then
    if command grep gpd0 <<< $(ifconfig -s) >& /dev/null; then
        echo "VPN is already connected"
    else
        globalprotect connect --portal vpn.amd.com --username kshenoy
    fi
}
#+end_src

#+begin_src bash :tangle (if (string-match "buntu" (system-name)) (concat (getenv "HOME") "/.bashrc") "no")
alias boot2win='sudo grub-reboot Windows && shutdown -r 0'
#+end_src

*** WSL
#+begin_src bash :tangle (if (string-match "windows" (system-name)) (concat (getenv "HOME") "/.bashrc") "no")
export LIBGL_ALWAYS_INDIRECT=1
# Need to specify the IP of the host
export DISPLAY=192.168.1.11:0
#+end_src

**** TODO Move WSL specific bash_profile and bashrc_local_override settings here

*** bashrc_local
And finally, check for a .bashrc_local and load it
#+begin_src bash
[[ -f ~/.bashrc_local_override ]] && . ~/.bashrc_local_override
#+end_src

** completion
Applying dumber completions first so that the smarter ones can come later and can override them

