bash/bashrc_literate
    # local _ulcorner="╭"
    local _llcorner="└"
    # local _llcorner="╰"
# prompt:1 ends here



# This is all the information I need to set my prompt!

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:2]]
# This has to be placed first
local _exit_status="$?"

# We use this instead of $COLUMNS as when a shell is starting, the $COLUMNS variable is not set
local _columns=$(tput cols)

# The info variables
local _pwd=$(prompt::get_compact_pwd)

# Force time to US Mountain Time. I don't want to export TZ as it messes up some other scripts
local _time="$(TZ=US/Mountain date +%I:%M%P) "
local _user="$(whoami) "
local _user_host_sep="@ "
local _pwd_sep="in "
local _host="$(hostname) "
# prompt:2 ends here



# If root user then colour the arrow red.

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:3]]
if (( "$UID" == 0 )); then
    local _fg_user_symbol=$_fg_red
else
    local _fg_user_symbol=${_bold}${_fg_light_black}
fi
# prompt:3 ends here



# VCS specific

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:4]]
local _vcs_type=$(vcs::get_type)
local _vcs_branch=$(vcs::get_branch $_vcs_type)
local _vcs_sep=" on "

if [[ $_vcs_type == "git" ]]; then
    local _user_symbol=" ±"
elif [[ $_vcs_type == "hg" ]]; then
    local _user_symbol=" ☿"
elif [[ $_vcs_type == "p4" ]]; then
    local _vcs_sep=" on "
else
    #local _user_symbol=" ○"
    #local _user_symbol=" ➤"
    local _user_symbol=" $"
    local _vcs_sep=""
fi
# prompt:4 ends here



# Here, I try to decide what all to put on the prompt depending on the width of the screen.
# I work backwards by constructing the full prompt and remove stuff if it's longer than the screen width as most of the it won't be.

# Start with everything of interest

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:5]]
_info="${_ulcorner} ${_user}${_user_host_sep}${_host}${_pwd_sep}${_pwd}${_vcs_sep}${_vcs_branch} ${_time}"
# prompt:5 ends here



# If info is wider than the screen, drop the time

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:6]]
if (( $_columns < ${#_info} )); then
    _time=""
    _info="${_ulcorner} ${_user}${_user_host_sep}${_host}${_pwd_sep}${_pwd}${_vcs_sep}${_vcs_branch} "
fi
_pwd_sep="${_fg_light_black}${_pwd_sep}${_reset}"
# prompt:6 ends here



# If the info still can't fit, drop user and domain info

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:7]]
if (( $_columns < ${#_info} )); then
    _user=""
    _user_host_sep=""
    _host=""
    _pwd_sep=""
    _info="${_ulcorner} ${_pwd}${_vcs_sep}${_vcs_branch} "
fi
# prompt:7 ends here



# If the info still can't fit, drop vcs branch

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:8]]
if (( $_columns < ${#_info} )); then
    _vcs_sep=""
    _vcs_branch=""
    _info="${_ulcorner} ${_pwd} "
fi
# prompt:8 ends here



# If the info still can't fit, truncate PWD

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:9]]
if (( $_columns < ${#_info} )); then
    _pwd_sep="..."
    while (( $_columns < ${#_info} )); do
        _pwd=`echo $_pwd | sed 's|^/\?[^/]*/||'`
        _info="${_ulcorner} ${_pwd_sep}${_pwd} "
    done
    _pwd_sep="${_bold}${_fg_green}${_pwd_sep}${_reset}"
fi

local _fillsize=$(( $_columns - ${#_info} - 1 ))
local _fill=$(printf "${_dash}%.0s" $(seq 1 $_fillsize))" "
# prompt:9 ends here



# Colorize vcs:

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:10]]
if [[ $_vcs_type == "git" ]]; then
    local _vcs_status=$(vcs::get_status ${_vcs_type} ${_vcs_branch})
    if [[ "${_vcs_status}" == "staged" ]]; then
        _vcs_branch="${_fg_yellow}${_vcs_branch}${_reset}"
    elif [[ "${_vcs_status}" == "modified" ]]; then
        _vcs_branch="${_fg_red}${_vcs_branch}${_reset}"
    elif [[ "${_vcs_status}" == "committed" ]]; then
        _vcs_branch="${_fg_green}${_vcs_branch}${_reset}"
    fi
elif [[ $_vcs_type == "p4" ]]; then
    if (( $(p4 opened 2> /dev/null | wc -l) > 0 )); then
        _vcs_branch="${_fg_red}${_vcs_branch}${_reset}"
    else
        _vcs_branch="${_fg_green}${_vcs_branch}${_reset}"
    fi
fi
# prompt:10 ends here



# Create exit status indicator based on exit status of last command

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:11]]
if (( "$_exit_status" == 0 )); then
    _exit_status="${_bold}${_fg_green} (^_^)"
else
    _exit_status="${_fg_red} (@_@)"
fi
# prompt:11 ends here



# Now that I've decided what all I want to put on the prompt and how, it's time to set the prompt variables

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:12]]
PS1="\n${_reset}"
PS1+="${_fg_light_black}${_ulcorner}${_reset} "
PS1+="${_fg_red}${_user}${_reset}"
PS1+="${_fg_light_black}${_user_host_sep}${_reset}"
PS1+="${_fg_yellow}${_host}${_reset}"
PS1+="${_pwd_sep}"
PS1+="${_fg_blue}${_pwd}${_reset}"
PS1+="${_fg_light_black}${_vcs_sep}${_reset}"
PS1+="${_vcs_branch} "
PS1+="${_fg_light_black}${_fill}${_reset}"
PS1+="${_fg_yellow}${_time}${_reset}"
PS1+="\n"
PS1+="${_fg_light_black}${_llcorner}${_reset}"
PS1+="${_exit_status}${_reset}"
PS1+="${_fg_user_symbol}${_user_symbol}${_reset} "

PS2="      ${_fg_user_symbol}...${_reset}   "
# prompt:12 ends here



# Evaluate dynamic variables only if dyn_vars is defined (Not required for prompt)

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:13]]
declare -F dyn_vars &> /dev/null && dyn_vars
# prompt:13 ends here



# Set HISTFILE here to keep it current when sessions span multiple days
# FIXME: Find a better way to do this i.e. do it once a day instead of everytime the prompt is refreshed

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:14]]
HISTFILE="${XDG_DATA_HOME:-$HOME/.local/share}/bash_history/$(date +%Y/%m/%d)_${HOSTNAME%%.*}_${USER}_$$"
[[ -d $(dirname ${HISTFILE}) ]] || mkdir -p $(dirname ${HISTFILE})
# prompt:14 ends here



# Write to the history file immediately instead of waiting till the end of the session

# [[file:~/.config/dotfiles/bash/bashrc.org::*prompt][prompt:15]]
history -a
}
# prompt:15 ends here

# PATH

# [[file:~/.config/dotfiles/bash/bashrc.org::*PATH][PATH:1]]
if ((which ruby &> /dev/null) && (which gem &> /dev/null)); then
  export PATH="$(ruby -rubygems -e 'puts Gem.user_dir')/bin:$PATH"
fi
export PATH="$HOME/bin:$HOME/.local/bin:$PATH"
clnpath
# PATH:1 ends here

# home
# Update permissions of the history when exiting as root

# [[file:~/.config/dotfiles/bash/bashrc.org::*home][home:1]]
__histfile_perm_update__() {
    if [[ -f $HISTFILE ]]; then
        echo "Changing permissions of HISTFILE..."
        chown kshenoy $HISTFILE
        chgrp kshenoy $HISTFILE
        chmod 640 $HISTFILE
    fi
}
trap __histfile_perm_update__ EXIT

## When leaving the console, clear the screen to increase privacy
if [[ "$SHLVL" = 1 ]]; then
    [[ -x /usr/bin/clear_console ]] && /usr/bin/clear_console -q
fi
# home:1 ends here

# bashrc_local
# And finally, check for a .bashrc_local and load it

# [[file:~/.config/dotfiles/bash/bashrc.org::*bashrc_local][bashrc_local:1]]
[[ -f ~/.bashrc_local_override ]] && . ~/.bashrc_local_override
