bash/bashrc.org
*** command completion
#+begin_src bash
if [[ -f /etc/bash_completion ]] && ! shopt -oq posix; then
    . /etc/bash_completion
fi

complete -A hostname   rsh rcp telnet rlogin r ftp ping disk
complete -A export     printenv
complete -A variable   export local readonly unset
complete -A enabled    builtin
complete -A alias      alias unalias
complete -A function   function
complete -A user       su mail finger

complete -A helptopic  help     # currently same as builtins
complete -A shopt      shopt
complete -A stopped -P '%' bg
complete -A job -P '%' fg jobs disown

complete -A directory  mkdir rmdir
complete -A directory  -o default cd

# Compression
complete -f -o default -X '*.+(zip|ZIP)'  zip
complete -f -o default -X '!*.+(zip|ZIP)' unzip
complete -f -o default -X '*.+(z|Z)'      compress
complete -f -o default -X '!*.+(z|Z)'     uncompress
complete -f -o default -X '*.+(gz|GZ)'    gzip
complete -f -o default -X '!*.+(gz|GZ)'   gunzip
complete -f -o default -X '*.+(bz2|BZ2)'  bzip2
complete -f -o default -X '!*.+(bz2|BZ2)' bunzip2

# Misc filetypes
complete -f -o default -X '!*.ps'  gs ghostview ps2pdf ps2ascii
complete -f -o default -X '!*.dvi' dvips dvipdf xdvi dviselect dvitype
complete -f -o default -X '!*.pdf' acroread pdf2ps
complete -f -o default -X '!*.+(pdf|ps)' gv
complete -f -o default -X '!*.texi*' makeinfo texi2dvi texi2html texi2pdf
complete -f -o default -X '!*.tex' tex latex slitex
complete -f -o default -X '!*.lyx' lyx
complete -f -o default -X '!*.+(htm*|HTM*)' lynx html2ps
complete -f -o default -X '!*.pl'  perl perl5
complete -f -o default -X '!*.gv'   dot
complete -f -o default -X '!*.gif'  kview

# Multimedia
#complete -f -o default -X '!*.+(jp*g|gif|xpm|png|bmp)' xv gimp
#complete -f -o default -X '!*.+(mp3|MP3)' mpg123 mpg321
#complete -f -o default -X '!*.+(ogg|OGG)' ogg123
#+end_src

*** fzf completion
Rest of fzf configuration defined above: [[*\[\[https://github.com/junegunn/fzf\]\[fzf\]\]][fzf]]

#+begin_src bash
[[ $- == *i* ]] && source "$FZF_PATH/shell/completion.bash" 2> /dev/null
#+end_src

*** TODO COMMENT tmux completion
Use tmux/tmux_completion.bash

*** alias completion
Automatically add completion for all aliases to commands having completion functions
This must be called only at the very end

#+begin_src bash
_compl_alias() {
    [[ -z "$1" ]] && return
    local _alias="$1"

    if (( $# >= 2 )); then
        local _cmd="$2"
    else
        local _cmd="$(alias $_alias 2> /dev/null | sed -e 's/^.*=//' -e 's/ .*$//' | tr -d "'")"
    fi
    [[ -z "$_cmd" ]] && return

    eval "$(complete -p $_cmd | sed "s/$_cmd$/$_alias/")"
}
#+end_src

Note the order of application is important
#+begin_src bash
_compl_alias e    emacs
_compl_alias g    grep
_compl_alias v    vim
_compl_alias vd   diff
_compl_alias vile less
for _alias in C P gi gv l la ll lla doomacs; do
    _compl_alias "$_alias"
done
#+end_src

* COMMENT inputrc
The use of ~set keymap~ below doesn't look right. =/etc/inputrc= seems to be using ~$if mode~ instead

#+begin_src bash
## Readline settings

# prepends a symbol to PS1 to indicate whether we're in emacs/vi mode
# set show-mode-in-prompt-on

# Handle Meta (Alt) correctly
set meta-flag on
set convert-meta off
set output-meta on

# Rebind C-A-H to ignore hyphens and underscores while deleting a filename
#$if mode=emacs
#"\eC-h": unix-filename-rubout
#$endif

# Don't beep!
set bell-style none

# Case-insensitive filename matching and completion
set completion-ignore-case on

set keymap emacs
# Switch to vi mode
"\C-x\C-t": vi-editing-mode

# Switch to emacs mode
set keymap vi-command
"\C-x\C-t": emacs-editing-mode
set keymap vi-insert
"\C-x\C-t": emacs-editing-mode

# Open up $VISUAL to edit command
set keymap vi-command
"\C-x\C-e": edit-and-execute-command
set keymap vi-insert
"\C-x\C-e": edit-and-execute-command


# Set default editing mode
set editing-mode emacs
#+end_src

* LS_COLORS/dircolors
:PROPERTIES:
:header-args+: :tangle generated/dircolors
:END:

#+begin_src bash :export none
# This is a tangled file. Do not make any changes here. All changes should preferably be made in the original Org file.
# Use =org-babel-tangle-jump-back-to-org= to jump back to it from any code block.
# If any changes are made here, use =org-babel-detangle= to add it back to the original Org mode file.
#+end_src

=ls= uses the value of the environment variable =LS_COLORS= to display. =dircolors= is a utility to set =LS_COLORS=

=COLOR= needs one of these arguments:
- ~tty~ colorizes output to ttys, but not pipes.
- ~all~ adds color characters to all output
- ~none~ shuts colorization off.
#+begin_src bash
COLOR tty
#+end_src

Extra command line options for ls go here. Basically these ones are:
~-F~ show '/' for dirs, '*' for executables, etc.
~-T 0~ don't trust tab spacing when formatting ls output.
#+begin_src bash :tangle no
OPTIONS -F -T 0
#+end_src

There should be one TERM entry for each termtype that is colorizable
#+begin_src bash
TERM Eterm
TERM ansi
TERM color_xterm
TERM con132x25
TERM con132x30
TERM con132x43
TERM con132x60
TERM con80x25
TERM con80x28
TERM con80x30
TERM con80x43
TERM con80x50
TERM con80x60
TERM console
TERM dtterm
TERM gnome
TERM kon
TERM konsole
TERM kterm
TERM linux
TERM linux-c
TERM mach-color
TERM rxvt
TERM screen
TERM screen
TERM screen-w
TERM screen.linux
TERM uxterm
TERM vt100
TERM xterm
TERM xterm-256color
TERM xterm-debian
#+end_src

These are the color init strings for the basic file types. A color init string consists of one or more of the following numeric codes:
Attribute codes: 00:Normal, 01:Bold, 04:Underline, 05=Blink, 06:Outline, 07:Reverse, 08:Concealed
| Color   | Foreground | Background |
|-----------------------------------|
| black   |     30     |     40     |
| red     |     31     |     41     |
| green   |     32     |     42     |
| yellow  |     33     |     43     |
| blue    |     34     |     44     |
| magenta |     35     |     45     |
| cyan    |     36     |     46     |
| white   |     37     |     47     |

#+begin_src bash
BLK     40;33;01    # block device driver
CHR     40;33;01    # character device driver
DIR     00;34       # directory
DOOR    01;35       # door
EXEC    00;32       # files with execute permissions
FIFO    40;33       # pipe
FILE    00          # normal file
LINK    00;36       # symbolic link. (If this is set to 'target' instead of a numerical value, the color is as for the file pointed to.)
MISSING 05;37;41    # ... and the files they point to
NORMAL  00          # global default, although everything should be something.
ORPHAN  01;37;41    # orphaned syminks
SOCK    01;35       # socket
#+end_src

List any file extensions like '.gz' or '.tar' that you would like ls to colorize below. Put the extension, a space, and the color init string.
(and any comments you want to add after a '#')

Executables
#+begin_src bash
.cmd 00;32
.exe 00;32
.com 00;32
.btm 00;32
.bat 00;32
.sh  00;32
.csh 00;32
#+end_src

Archives or compressed files
#+begin_src bash
.tar  00;31
.tgz  00;31
.arj  00;31
.taz  00;31
.lzh  00;31
.zip  00;31
.z    00;31
.Z    00;31
.gz   00;31
.bz2  00;31
.deb  00;31
.rpm  00;31
.jar  00;31
.bz   00;31
.tz   00;31
.cpio 00;31
#+end_src

Image formats
#+begin_src bash
.jpg  00;35
.jpeg 00;35
.gif  00;35
.bmp  00;35
.pbm  00;35
.pgm  00;35
.ppm  00;35
.tga  00;35
.xbm  00;35
.xpm  00;35
.tif  00;35
.tiff 00;35
.png  00;35
.mpg  00;35
.mpeg 00;35
.avi  00;35
.fli  00;35
.gl   00;35
.dl   00;35
.xcf  00;35
.xwd  00;35
#+end_src

Audio formats
#+begin_src bash
.ogg 00;35
.mp3 00;35
.wav 00;35
#+end_src

Documents
#+begin_src bash :tangle no
.csv 00;00
.xls 00;00
.pdf 00;00
.doc 00;00
.txt 00;00
.md  00;00
.ppt 00;00
#+end_src

* Local variables
:PROPERTIES:
:header-args+: :export none :tangle no
:END:
Use =add-file-local-variable= or =add-file-local-variable-prop-line= instead of adding these manually

[[https://www.reddit.com/r/emacs/comments/372nxd/how_to_move_init_to_orgbabel/crjicdv/][Auto-tangle on save]] - Not using it because it was too aggressive for at least this file considering how often I tinker with it
# eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t)

# Local Variables:
# End:
